DataProcessors/омг_ПодборУслуг_85.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_ПодборУслуг_85</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Набор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/омг_ПодборУслуг_85/Forms/Форма85/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	Если Параметры.Свойство("Филиал") Тогда
		МедицинскийЦентр = Параметры.Филиал; 
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("Филиал", МедицинскийЦентр);
	Страховая = Неопределено;
	Параметры.Свойство("СтраховаяПрограмма", Страховая);
	
	Если ЗначениеЗаполнено(Страховая) Тогда
		Прейскурант = Страховая;
	Иначе
		Прейскурант = Справочники.Прейскуранты.НайтиПоНаименованию("Розничная цена");
		
		Если Прейскурант.Пустая() Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Прейскуранты ГДЕ НЕ ПометкаУдаления");
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Прейскурант = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Прейскурант", Прейскурант);
	
	ТолькоСЦенами = Истина;
	ОбновитьОтборПоЦенеНаСервере();	
КонецПроцедуры
&НаКлиенте
Процедура ТолькоСЦенамиПриИзменении(Элемент)
	ОбновитьОтборПоЦенеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрейскурантПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("Прейскурант", Прейскурант);
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборПоЦенеНаСервере()
	
	ЭлементыДляУдаления = Новый Массив;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") 
			И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Цена") Тогда
			ЭлементыДляУдаления.Добавить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Эл Из ЭлементыДляУдаления Цикл
		Список.Отбор.Элементы.Удалить(Эл);
	КонецЦикла;
	
	Если ТолькоСЦенами Тогда
		ЭлементОтбораЦена = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораЦена.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Цена");
		ЭлементОтбораЦена.ВидСравнения  = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбораЦена.ПравоеЗначение = 0;
		ЭлементОтбораЦена.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Набор") Тогда
		ДобавитьНаборВКорзинуНаСервере(ТекущиеДанные.Ссылка);
		ПересчитатьИтогоКорзины()

	Иначе
		ДобавитьВКорзинуКлиент(ТекущиеДанные.Ссылка, ТекущиеДанные.Цена);
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьВКорзинуКлиент(Номенклатура, Цена, Набор = Неопределено, НаборЛИС = Неопределено)
	
	ПустаяНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	
	КорневыеСтроки = Корзина.ПолучитьЭлементы();
	
	СтрокаКорзины = Неопределено;
	Для Каждого Стр Из КорневыеСтроки Цикл
		Если Стр.Номенклатура = Номенклатура И Стр.омг_Набор = ПустаяНоменклатура Тогда
			СтрокаКорзины = Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаКорзины = Неопределено Тогда
		СтрокаКорзины = КорневыеСтроки.Добавить();
		СтрокаКорзины.Номенклатура = Номенклатура;
		СтрокаКорзины.Количество   = 1;
		СтрокаКорзины.Цена         = Цена;
		СтрокаКорзины.омг_Набор    = ПустаяНоменклатура;
		СтрокаКорзины.омг_НаборЛИС = ?(НаборЛИС = Неопределено, ПустаяНоменклатура, НаборЛИС);
	Иначе
		СтрокаКорзины.Количество = СтрокаКорзины.Количество + 1;
	КонецЕсли;
	
	СтрокаКорзины.Сумма = СтрокаКорзины.Количество * СтрокаКорзины.Цена;
	
	Элементы.Корзина.ТекущаяСтрока = СтрокаКорзины.ПолучитьИдентификатор();
	
	ПересчитатьИтогоКорзины();
КонецПроцедуры 

&НаСервере
Функция ЭтоНаборЛИС(НоменклатураСсылка)
	ГруппаЛИС = Константы.омг_ГруппаЛабораторныхИсследований.Получить();
	
	Если НоменклатураСсылка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор 
		И НоменклатураСсылка.ПринадлежитЭлементу(ГруппаЛИС) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ДобавитьНаборВКорзинуНаСервере(СсылкаНабора, РодительскаяСтрока = Неопределено, ВходящийГлавныйНабор = Неопределено, ВходящийНаборЛИС = Неопределено)
	
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	ЯвляетсяЛИС = ЭтоНаборЛИС(СсылкаНабора);
	ТекущийНаборЛИС = ВходящийНаборЛИС;
	Если ЯвляетсяЛИС Тогда
		ТекущийНаборЛИС = СсылкаНабора;
	ИначеЕсли ТекущийНаборЛИС = Неопределено Тогда
		ТекущийНаборЛИС = ПустаяНоменклатура;
	КонецЕсли;
	
	ГлавныйНабор = ВходящийГлавныйНабор;
	Если ГлавныйНабор = Неопределено Тогда
		Если НЕ ЯвляетсяЛИС Тогда
			ГлавныйНабор = СсылкаНабора;
		Иначе
			ГлавныйНабор = ПустаяНоменклатура;
		КонецЕсли;
	КонецЕсли;

	ТекущийРодитель = Неопределено; 
	Если РодительскаяСтрока = Неопределено Тогда
		КорневыеСтроки = Корзина.ПолучитьЭлементы();
		Для Каждого Стр Из КорневыеСтроки Цикл
			Если Стр.Номенклатура = СсылкаНабора Тогда
				ТекущийРодитель = Стр;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ТекущийРодитель = Неопределено Тогда
			ТекущийРодитель = КорневыеСтроки.Добавить();
			ТекущийРодитель.Номенклатура = СсылкаНабора;
			ТекущийРодитель.Количество   = 1;
		Иначе
			ТекущийРодитель.Количество = ТекущийРодитель.Количество + 1;
		КонецЕсли;
	Иначе
		ТекущийРодитель = РодительскаяСтрока;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	Цены.Цена КАК Цена,
		|	Цены.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, 
		|		Прейскурант = &Прейскурант 
		|		И омг_Филиал = &Филиал 
		|		И омг_Набор = &Набор) КАК Цены";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Прейскурант", Прейскурант);
	Запрос.УстановитьПараметр("Филиал", МедицинскийЦентр);
	Запрос.УстановитьПараметр("Набор", СсылкаНабора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогПоНабору = 0; 
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаУслуги = Неопределено;
		Для Каждого Стр Из ТекущийРодитель.ПолучитьЭлементы() Цикл
			Если Стр.Номенклатура = Выборка.Номенклатура Тогда
				СтрокаУслуги = Стр;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
			Если СтрокаУслуги = Неопределено Тогда
				СтрокаУслуги = ТекущийРодитель.ПолучитьЭлементы().Добавить();
				СтрокаУслуги.Номенклатура = Выборка.Номенклатура;
				СтрокаУслуги.Количество   = 1;
			Иначе
				СтрокаУслуги.Количество = СтрокаУслуги.Количество + 1;
			КонецЕсли;
			
			ДобавитьНаборВКорзинуНаСервере(Выборка.Номенклатура, СтрокаУслуги, ГлавныйНабор, ТекущийНаборЛИС);
			
			ИтогПоНабору = ИтогПоНабору + СтрокаУслуги.Сумма;
		Иначе
			Если СтрокаУслуги = Неопределено Тогда
				СтрокаУслуги = ТекущийРодитель.ПолучитьЭлементы().Добавить();
				СтрокаУслуги.Номенклатура = Выборка.Номенклатура;
				СтрокаУслуги.Цена         = Выборка.Цена;
				СтрокаУслуги.Количество   = 1;
			Иначе
				СтрокаУслуги.Количество = СтрокаУслуги.Количество + 1;
			КонецЕсли;
			
			СтрокаУслуги.Сумма = СтрокаУслуги.Количество * СтрокаУслуги.Цена;
			СтрокаУслуги.омг_Набор    = ГлавныйНабор;
			СтрокаУслуги.омг_НаборЛИС = ТекущийНаборЛИС;
			
			ИтогПоНабору = ИтогПоНабору + СтрокаУслуги.Сумма;
		КонецЕсли;
		
	КонецЦикла;	
	
	КоличествоРодителя = ?(ТекущийРодитель.Количество = 0, 1, ТекущийРодитель.Количество);
	ТекущийРодитель.Цена  = ИтогПоНабору / КоличествоРодителя;
	ТекущийРодитель.Сумма = ИтогПоНабору;
	
КонецПроцедуры


&НаКлиенте
Процедура КорзинаКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Корзина.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	КонецЕсли;
	ПересчитатьИтогоКорзины()

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Если Корзина.ПолучитьЭлементы().Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Корзина пуста! Выберите услуги.");
		Возврат;
	КонецЕсли;
	
	ВыбранныеТовары = Новый Массив;
	СобратьДанныеИзДерева(Корзина.ПолучитьЭлементы(), ВыбранныеТовары);
	
	ОповеститьОВыборе(ВыбранныеТовары);
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанныеИзДерева(СтрокиДерева, МассивРезультат)
	
	Для Каждого Стр Из СтрокиДерева Цикл
		Если Стр.ПолучитьЭлементы().Количество() > 0 Тогда
			СобратьДанныеИзДерева(Стр.ПолучитьЭлементы(), МассивРезультат);
		Иначе
			НоваяЗапись = Новый Структура("Номенклатура, Количество, Цена, Сумма, омг_Набор, омг_НаборЛИС");
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
			МассивРезультат.Добавить(НоваяЗапись);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
&НаКлиенте
Процедура ПересчитатьИтогоКорзины()
	
	ИтогоСтоимостьКорзины = ПодсчитатьСуммуТолькоУслуг(Корзина.ПолучитьЭлементы());
	
	
КонецПроцедуры

&НаКлиенте
Функция ПодсчитатьСуммуТолькоУслуг(Строки)
	
	СуммаУровня = 0;
	
	Для Каждого Стр Из Строки Цикл
		Если Стр.ПолучитьЭлементы().Количество() = 0 Тогда
			СуммаУровня = СуммаУровня + Стр.Сумма;
		Иначе
			СуммаУровня = СуммаУровня + ПодсчитатьСуммуТолькоУслуг(Стр.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
	
	Возврат СуммаУровня;
	
КонецФункции

&НаКлиенте
Процедура КорзинаПриИзменении(Элемент)
	ПересчитатьИтогоКорзины();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьКорзину(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТекущийЭлемент = Элементы.СписокСтрокаПоиска;
КонецПроцедуры
